//=============================================================================
//
// 切り倒し処理 [cut_down.h]
// Author : 
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define CUT_DOWN_OBJECT_MAX		(5)			// 切り倒せるオブジェクトのMax数
#define PI 3.14159265f // 円周率

// 切り倒せるオブジェクト構造体
struct CUT_DOWN_OBJECT{
	bool					use;		// true:使っている  false:未使用
	D3DXVECTOR2				size;		// 幅と高さ
	D3DXVECTOR2				pos;		// ポリゴンの座標
	float					rot;		// ポリゴンの回転量
	int						texNo;		// 何番目のテクスチャーを使用するのか

	int						state;		// 状態
};




//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitCutDownObject(void);
void	UninitCutDownObject(void);
void UpdateCutDownObject(void);
void DrawCutDownObject(void);


